**Name: Jawad-Haider**

**Roll No.: SU92-BSAIM-F24-056**

**Section: BSAI-3A**

**Task: 9**

**Import Libraries**

In [30]:
import pandas as pd


<b>1. Data Gathering</b> : <a href="https://www.kaggle.com/datasets/mamunhasan2cs/student-academic-performance-synthetic-dataset?resource=download"> DataSet from Kaggle </a>

**2. Data Loading**

In [31]:
df = pd.read_csv("student_performance.csv")
df

     Student_ID  Age  Gender  Study_Hours  Attendance(%)  Test_Score Grade
0         S0524   21  Female          NaN           74.0          37     F
1         S0603   19    Male          1.5           93.1          26     F
2         S0527   20  Female          6.8           97.2          88     A
3         S0032   18  Female          6.2           93.5          55     C
4         S0617   21    Male          7.4           99.2          77     B
...         ...  ...     ...          ...            ...         ...   ...
1015      S0107   22  Female          6.3           84.7          72     B
1016      S0271   22    Male          5.3          100.5          45     F
1017      S0861   21  Female          4.0          102.7          30     F
1018      S0436   18  Female          6.3           92.4          55     C
1019      S0103   21  Female          1.6            NaN          37     F

[1020 rows x 7 columns]

In [32]:
df['Attendance(%)'] = df['Attendance(%)'].clip(upper=100)

In [33]:
df

     Student_ID  Age  Gender  Study_Hours  Attendance(%)  Test_Score Grade
0         S0524   21  Female          NaN           74.0          37     F
1         S0603   19    Male          1.5           93.1          26     F
2         S0527   20  Female          6.8           97.2          88     A
3         S0032   18  Female          6.2           93.5          55     C
4         S0617   21    Male          7.4           99.2          77     B
...         ...  ...     ...          ...            ...         ...   ...
1015      S0107   22  Female          6.3           84.7          72     B
1016      S0271   22    Male          5.3          100.0          45     F
1017      S0861   21  Female          4.0          100.0          30     F
1018      S0436   18  Female          6.3           92.4          55     C
1019      S0103   21  Female          1.6            NaN          37     F

[1020 rows x 7 columns]

**3. Data Exploration**

In [34]:
df.head()

  Student_ID  Age  Gender  Study_Hours  Attendance(%)  Test_Score Grade
0      S0524   21  Female          NaN           74.0          37     F
1      S0603   19    Male          1.5           93.1          26     F
2      S0527   20  Female          6.8           97.2          88     A
3      S0032   18  Female          6.2           93.5          55     C
4      S0617   21    Male          7.4           99.2          77     B

In [35]:
df.tail()

     Student_ID  Age  Gender  Study_Hours  Attendance(%)  Test_Score Grade
1015      S0107   22  Female          6.3           84.7          72     B
1016      S0271   22    Male          5.3          100.0          45     F
1017      S0861   21  Female          4.0          100.0          30     F
1018      S0436   18  Female          6.3           92.4          55     C
1019      S0103   21  Female          1.6            NaN          37     F

In [36]:
df.shape
print(f"Number of Rows: {df.shape[0]} and Number of Columns: {df.shape[1]}")

Number of Rows: 1020 and Number of Columns: 7

In [37]:
df.isnull().sum()

Student_ID        0
Age               0
Gender            0
Study_Hours      32
Attendance(%)    31
Test_Score        0
Grade             9
dtype: int64

In [38]:
df = df.fillna(df.mode())
df

     Student_ID  Age  Gender  Study_Hours  Attendance(%)  Test_Score Grade
0         S0524   21  Female          5.7           74.0          37     F
1         S0603   19    Male          1.5           93.1          26     F
2         S0527   20  Female          6.8           97.2          88     A
3         S0032   18  Female          6.2           93.5          55     C
4         S0617   21    Male          7.4           99.2          77     B
...         ...  ...     ...          ...            ...         ...   ...
1015      S0107   22  Female          6.3           84.7          72     B
1016      S0271   22    Male          5.3          100.0          45     F
1017      S0861   21  Female          4.0          100.0          30     F
1018      S0436   18  Female          6.3           92.4          55     C
1019      S0103   21  Female          1.6            NaN          37     F

[1020 rows x 7 columns]

In [39]:
df.dtypes

Student_ID        object
Age                int64
Gender            object
Study_Hours      float64
Attendance(%)    float64
Test_Score         int64
Grade             object
dtype: object

In [40]:
df['Age'].unique()

array([21, 19, 20, 18, 23, 22, 24])

In [41]:
df.nunique()

Student_ID       1000
Age                 7
Gender              2
Study_Hours       106
Attendance(%)     323
Test_Score        101
Grade               5
dtype: int64

In [42]:
df.count()

Student_ID       1020
Age              1020
Gender           1020
Study_Hours       989
Attendance(%)     989
Test_Score       1020
Grade            1011
dtype: int64

In [43]:
df.describe()

               Age  Study_Hours  Attendance(%)   Test_Score
count  1020.000000   989.000000     989.000000  1020.000000
mean     20.970588     5.163802      84.606269    49.843137
std       2.008109     2.554734       9.514239    21.278630
min      18.000000    -2.000000      50.300000     0.000000
25%      19.000000     3.700000      78.000000    35.000000
50%      21.000000     5.100000      85.000000    50.000000
75%      23.000000     6.300000      91.900000    64.000000
max      24.000000    25.000000     100.000000   100.000000

In [44]:
df.columns

for i in df.columns:
    print(i)

Student_ID
Age
Gender
Study_Hours
Attendance(%)
Test_Score
Grade

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     1020 non-null   object
 1   Age            1020 non-null   int64
 2   Gender         1020 non-null   object
 3   Study_Hours    989 non-null    float64
 4   Attendance(%)  989 non-null    float64
 5   Test_Score     1020 non-null   int64
 6   Grade          1011 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 55.9+ KB